config/project/adp/xml/development-two_per_second_for_5_mins-case_worker_view_claim.xml
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE tsung SYSTEM "/Users/stephen/src/tsung-wrapper/config/project/adp/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="protocol" version="1.0">
  <!-- Client Side Setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="9000"/>
  </clients>
  <!-- Server Side Setup -->
  <servers>
    <server host="test_server_host" port="3000" type="tcp"/>
  </servers>
  <load>
    <!-- Scenario 1: Two per second for 5 minutes -->
    <arrivalphase phase="1" duration="5" unit="minute">
      <users maxnumber="1000" arrivalrate="0.5" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <!-- Define User Agents -->
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>
  <sessions>
    <session name="case_worker_view_claim-20151002-141438" probability="100" type="ts_http">
      <!-- GET Landing Page -->
      <thinktime random="true" value="4"/>
      <request>
        <match do="abort" when="match" name="abort_unless_success_or_redirect">HTTP/1.1 [^2|^3][0-9]{2}</match>
        <http url="http://localhost:3000" version="1.1" method="GET">
        </http>
      </request>
      <!-- POST login as advocate -->
      <thinktime random="true" value="4"/>
      <request>
        <match do="abort" when="match" name="abort_unless_success_or_redirect">HTTP/1.1 [^2|^3][0-9]{2}</match>
        <http url="http://localhost:3000/users/sign_in" version="1.1" contents="user%5Bemail%5D=caseworkeradmin%40example.com&amp;user%5Bpassword%5D=liverbird&amp;utf8=%E2%9C%93" content_type="application/x-www-form-urlencoded" method="POST">
        </http>
      </request>
      <!-- GET claim 1 -->
      <thinktime random="true" value="4"/>
      <request>
        <match do="abort" when="match" name="abort_unless_success_or_redirect">HTTP/1.1 [^2|^3][0-9]{2}</match>
        <http url="http://localhost:3000/case_workers/claims/1" version="1.1" method="GET">
        </http>
      </request>
    </session>
  </sessions>
</tsung>